{
  "meta": {
    "product": "Capability Discovery Interface",
    "description": "Candidate-controlled landing page that enables employers to evaluate reasoning, learning, and fit through investigation rather than filtering.",
    "guiding_principles": [
      "Foundations before features",
      "Verification is a product requirement",
      "Static-first, extend later",
      "Small tasks, provable completion",
      "CI must stay green"
    ]
  },
  "requirements": [
    {
      "id": "env-001",
      "title": "Reproducible development environment initializes successfully",
      "description": "Set up a reproducible development environment that can be installed and run from a clean checkout.",
      "acceptance_criteria": [
        "Repository installs dependencies using a single documented command",
        "A development server can be started locally",
        "A production build command exists and completes successfully",
        "README documents install, dev, build, and test commands",
        "All commands succeed on a clean machine"
      ],
      "verification": [
        "Run install command from clean checkout",
        "Run dev server command and verify process starts",
        "Run build command and verify successful exit"
      ],
      "passes": true
    },
    {
      "id": "test-001",
      "title": "Test harness is configured and runs in CI",
      "description": "Establish a minimal automated test setup to verify future features.",
      "acceptance_criteria": [
        "A test runner is configured",
        "At least one test file exists",
        "Tests can be run via a single command",
        "Tests run as part of CI or a local equivalent",
        "Test command exits successfully"
      ],
      "verification": [
        "Run test command locally",
        "Verify at least one passing test",
        "Verify test command fails if assertion is broken"
      ],
      "passes": true
    },
    {
      "id": "ui-001",
      "title": "Landing page renders with evaluation-focused framing",
      "description": "Create a minimal landing page that frames the site as an evaluation surface rather than a resume or portfolio.",
      "acceptance_criteria": [
        "Root route renders without errors",
        "Page includes a clear positioning statement about evaluation",
        "Language avoids resume-style claims",
        "Page content is static and deterministic",
        "Page is covered by at least one automated test"
      ],
      "verification": [
        "Start dev server and load root route",
        "Run test suite and verify landing page test passes"
      ],
      "passes": true
    },
    {
      "id": "ui-002",
      "title": "Exploration path is visible on landing page",
      "description": "Provide visible entry points that invite investigation, even if underlying features are placeholders.",
      "acceptance_criteria": [
        "Landing page includes at least two exploration CTAs",
        "CTAs clearly describe future interaction (e.g. 'Ask how I work', 'Check role fit')",
        "CTA targets are valid routes or placeholders",
        "Routes render without runtime errors",
        "Routes are covered by minimal tests"
      ],
      "verification": [
        "Navigate to CTA routes",
        "Run test suite verifying route rendering"
      ],
      "passes": true
    },
    {
  "id": "exp-001",
  "title": "Canonical experience data model exists and is validated",
  "description": "Introduce a structured, typed representation of personal experiences that serves as the single source of truth for future UI rendering and AI grounding.",
  "acceptance_criteria": [
    "A canonical experience data model is defined in code (e.g. TypeScript interfaces or schema)",
    "The model captures: context, constraints, decisions, outcomes, and lessons learned",
    "At least the three existing experiences are represented using this model",
    "Experience data is stored in a deterministic, version-controlled format (e.g. TS/JSON)",
    "The model is imported successfully by application code without runtime errors",
    "The data model is explicitly documented in code comments or README",
    "The data model can be extended without breaking existing consumers"
  ],
  "verification": [
    "Typecheck succeeds with the new model",
    "Application builds successfully after adding the model",
    "At least one automated test validates the structure or contents of the experience data",
    "Breaking the model shape causes tests or typecheck to fail"
  ],
  "passes": true
},
{
  "id": "exp-002",
  "title": "Read-only Experience Explorer renders canonical experience data",
  "description": "Expose the canonical experience data model through a read-only UI that allows employers to explore context, constraints, decisions, outcomes, and lessons learned.",
  "acceptance_criteria": [
    "A new route exists for exploring experiences (e.g. /experience or /experiences)",
    "The UI renders experiences exclusively from the canonical experience data model",
    "At least one experience can be selected and viewed in detail",
    "The detail view displays context, constraints, decisions, outcomes, and lessons learned",
    "Navigation between experiences is possible without page reloads",
    "The UI is deterministic and contains no AI-generated content",
    "The implementation introduces no breaking changes to existing routes",
    "All rendered content avoids resume-style claims and marketing language"
  ],
  "verification": [
    "Navigate to the experience explorer route and view each experience",
    "Verify that rendered content matches the canonical data model exactly",
    "Run test suite and confirm new UI tests pass",
    "Break experience data shape and confirm tests or typecheck fail"
  ],
  "passes": true
},
{
  "id": "exp-003",
  "title": "Explicit strengths and gaps matrix is visible and trustworthy",
  "description": "Provide a clear, honest, static matrix of strengths and gaps that helps employers quickly assess alignment and avoid mismatched roles.",
  "acceptance_criteria": [
    "A new route exists for viewing strengths and gaps (e.g. /strengths or /fit-overview)",
    "Strengths are grouped into at least three categories (e.g. Strong, Developing, Not my strength)",
    "Each listed item uses clear, plain language without buzzwords or marketing claims",
    "Items are grounded in evidence from the canonical experience data model",
    "Gaps are explicitly stated and not softened with hedging language",
    "The matrix is static and deterministic (no AI-generated content)",
    "Language emphasizes fit and alignment, not self-promotion",
    "The page renders without errors and integrates with existing routing"
  ],
  "verification": [
    "Navigate to the strengths and gaps route and verify all categories render",
    "Confirm that listed strengths and gaps align with experience data",
    "Run test suite and verify page rendering is covered by automated tests",
    "Break referenced experience data and confirm tests or typecheck fail"
  ],
  "passes": true
},
{
  "id": "fit-001",
  "title": "Manual fit evaluation tool provides honest alignment assessment",
  "description": "Provide a deterministic, non-AI fit evaluation tool that helps employers assess alignment based on role characteristics and clearly explains where fit is strong, partial, or weak.",
  "acceptance_criteria": [
    "A new route exists for fit evaluation (e.g. /fit-evaluation)",
    "The page presents a small set of structured inputs describing the role (e.g. role type, domain, team context)",
    "Inputs are limited and intentional (no free-text job descriptions)",
    "Submitting the form produces a deterministic fit result",
    "Possible outcomes include at least: Strong fit, Partial fit, Not a fit",
    "Each outcome includes a clear explanation grounded in strengths and gaps data",
    "The tool explicitly advises against proceeding when fit is weak",
    "No AI or probabilistic logic is used",
    "Language emphasizes mutual time-saving and alignment, not persuasion"
  ],
  "verification": [
    "Navigate to the fit evaluation route and complete the form with different inputs",
    "Verify that identical inputs always produce identical results",
    "Verify that explanations reference strengths and gaps accurately",
    "Run test suite and confirm fit logic is covered by automated tests",
    "Break fit logic mapping and confirm tests fail"
  ],
  "passes": true
},
{
  "id": "ai-001",
  "title": "Grounded AI query interface enables experience interrogation",
  "description": "Introduce a constrained AI-powered query interface that allows employers to ask questions about experiences, decisions, strengths, gaps, and fit logic, grounded strictly in canonical data.",
  "acceptance_criteria": [
    "The existing /ask route is upgraded to an AI-powered query interface",
    "The AI is grounded exclusively in canonical experience data, strengths/gaps data, and fit logic",
    "The AI explicitly refuses to answer questions outside its grounding context",
    "Responses prioritize explanation of reasoning, decisions, and tradeoffs over summaries",
    "The AI can acknowledge gaps or uncertainty when data is insufficient",
    "The interface supports multi-turn follow-up questions",
    "The AI does not generate new claims, achievements, or metrics",
    "Language remains calm, factual, and non-promotional"
  ],
  "verification": [
    "Ask questions about each experience and verify answers match canonical data",
    "Ask a question outside scope and verify the AI refuses appropriately",
    "Ask follow-up questions and verify consistency across turns",
    "Run test suite including prompt or response snapshot tests",
    "Disable AI or break grounding input and verify tests fail"
  ],
  "passes": true
},
{
  "id": "exp-004",
  "title": "Experience data is synchronized with updated reference and system integrity is preserved",
  "description": "Update canonical experience data to reflect changes in experience_reference.md and ensure all dependent systems remain correct, consistent, and fully verified.",
  "acceptance_criteria": [
    "Canonical experience data files are updated to reflect the latest experience_reference.md",
    "All experience fields (context, constraints, decisions, outcomes, lessons learned, signals) accurately match the updated reference",
    "No stale or removed experiences remain in the data registry",
    "Any new experiences in the reference are added as separate, properly structured data files",
    "Experience IDs remain stable for existing experiences unless explicitly deprecated",
    "Strengths and gaps evidence references are updated to match the new experience set",
    "Fit evaluation explanations remain accurate given updated experience data",
    "Query engine responses reflect updated experience content without hallucination or mismatch"
  ],
  "verification": [
    "Run full test suite and confirm all existing tests pass",
    "Add or update tests to validate new or modified experiences",
    "Verify experience explorer renders all updated experiences correctly",
    "Verify strengths and gaps matrix references valid experience IDs",
    "Submit representative queries to the query engine and confirm responses align with updated experience data",
    "Intentionally introduce a mismatch between reference and data and confirm tests fail"
  ],
  "passes": true
},
{
  "id": "ux-001",
  "title": "Guided evaluation flow orients employers and accelerates fit decisions",
  "description": "Introduce a lightweight narrative and sequencing layer that helps employers understand where to start, how to explore, and when they have enough information to decide.",
  "acceptance_criteria": [
    "The landing page presents a clear recommended evaluation path with an estimated time cost (e.g. '2–5 minutes to decide fit')",
    "Each primary section (Experiences, Strengths, Fit, Ask) includes a short orientation explaining what questions it answers",
    "Orientation copy explicitly states when a section is sufficient to stop exploring",
    "Experiences page includes guidance on how to choose which experiences to read (not all are required)",
    "Strengths and gaps page explains how it should influence a hiring decision",
    "Fit evaluation page explains when its output should override further exploration",
    "Ask page explains what kinds of questions it can and cannot answer",
    "Cross-links between sections are intentional and directional (e.g. 'If this concerns you, check X next')",
    "Language remains neutral, factual, and non-promotional",
    "No new business logic, data models, or AI behavior is introduced"
  ],
  "verification": [
    "Follow the recommended evaluation path end-to-end and confirm it leads to a clear decision point",
    "Verify that each section includes explicit 'what this tells you' or 'when to stop' guidance",
    "Confirm existing functionality and logic remain unchanged",
    "Run test suite and verify orientation content is covered by UI tests"
  ],
  "passes": true
},
{
  "id": "deploy-001",
  "title": "Capability discovery interface is deployed and publicly accessible",
  "description": "Prepare and deploy the application so it can be shared with external reviewers without caveats or setup friction.",
  "acceptance_criteria": [
    "Application is deployed to a public URL",
    "Production build runs without errors",
    "Routing works correctly on page refresh",
    "All primary routes are accessible directly via URL",
    "README includes deployment URL and brief usage instructions",
    "No development-only warnings or placeholders are visible",
    "Build and test pipeline remains unchanged and passing"
  ],
  "verification": [
    "Visit deployed URL and navigate through full evaluation flow",
    "Refresh on nested routes and confirm no 404s",
    "Run CI pipeline and confirm green status",
    "Share URL with a non-technical user and confirm basic usability"
  ],
  "passes": true
},
{
  "id": "ui-003",
  "title": "Readability-first layout and typography improvements",
  "description": "Improve text readability and scanning comfort across the site without introducing branding, marketing visuals, or new interaction patterns.",
  "acceptance_criteria": [
    "All primary content is constrained to a readable max-width and centered",
    "Line length does not exceed comfortable reading limits on large screens",
    "Base font size and line height are increased for long-form reading",
    "A neutral system font stack is used (no custom or branded fonts)",
    "Clear visual hierarchy is established using spacing and headings, not color",
    "Primary CTAs remain visually discoverable without appearing sales-oriented",
    "No animations, illustrations, gradients, or decorative elements are added",
    "No new components, routes, or business logic are introduced",
    "All existing content, copy, and behavior remain unchanged"
  ],
  "verification": [
    "Visually inspect all major routes on desktop viewport (Landing, Experiences, Strengths, Fit Evaluation, Ask)",
    "Confirm text does not span full screen width on large displays",
    "Verify long sections are comfortable to read without horizontal scanning",
    "Run full test suite and confirm no regressions",
    "Confirm no snapshot or UI tests fail due to content changes"
  ],
  "passes": true
},
{
  "id": "ui-004",
  "title": "Reduce content density and improve scanability on landing page",
  "description": "Refine layout and content presentation to reduce cognitive load and improve scanability, without changing tone, meaning, or introducing visual branding.",
  "acceptance_criteria": [
    "Primary sections on the landing page are visually distinct through spacing and structure, not color or decoration",
    "Long paragraphs are broken into shorter paragraphs or lists where appropriate, without changing wording meaning",
    "Key guidance sections (Recommended Evaluation Path, When to Stop) are visually emphasized through layout hierarchy",
    "The evaluation path steps are easy to scan individually and do not require linear reading",
    "The page can be meaningfully skimmed in under 30 seconds",
    "No new copy is added beyond minimal structural helpers (e.g. labels, short lead-in lines)",
    "Tone remains neutral, factual, and non-persuasive",
    "No animations, illustrations, icons, or branding elements are introduced",
    "No new routes, components, or business logic are added"
  ],
  "verification": [
    "Visually inspect landing page on desktop viewport and confirm clear separation of conceptual sections",
    "Verify that key guidance sections are immediately noticeable without scrolling excessively",
    "Confirm that a reader can understand the intended evaluation flow by skimming headings and lists only",
    "Run full test suite and confirm no regressions",
    "Confirm all existing UI and snapshot tests pass without semantic changes"
  ],
  "passes": true
},
{
  "id": "copy-001",
  "title": "Centralize all user-facing copy into a single reference file",
  "description": "Collect all user-facing text content into a single plain-text or markdown file to support tone review, iteration, and external feedback.",
  "acceptance_criteria": [
    "All user-facing text from the application is extracted into a single file (e.g. copy.md or copy.txt)",
    "Content is grouped by page or section (Landing, Experiences, Strengths, Fit, Ask)",
    "Each section preserves the exact wording currently used in the UI",
    "No wording is changed as part of this task",
    "File clearly indicates where each text block appears in the UI",
    "No new logic, routes, or UI changes are introduced"
  ],
  "verification": [
    "Manually compare UI text against reference file to confirm completeness",
    "Confirm that all major pages are represented",
    "Run full test suite to ensure no regressions",
    "Confirm that application behavior and rendering are unchanged"
  ],
  "passes": true
},
{
  "id": "copy-002",
  "title": "Modularize user-facing copy into single-source-of-truth files",
  "description": "Refactor user-facing text into centralized, page-scoped copy modules to make tone iteration and wording changes easy, safe, and reviewable over time.",
  "acceptance_criteria": [
    "All user-facing copy is moved out of JSX and into dedicated copy modules",
    "Each primary page has a corresponding copy file (landing, experiences, strengths, fit, ask)",
    "Copy modules export plain strings or simple structured objects only (no logic, no functions)",
    "UI components import copy explicitly from their corresponding copy modules",
    "No copy is duplicated across files",
    "Existing wording is preserved exactly as-is during this refactor",
    "The centralized copy structure makes it possible to change wording by editing a single file per page",
    "copy.md remains as a human-review artifact and is not used as a runtime source"
  ],
  "verification": [
    "Manually verify that all visible text in the UI originates from copy modules",
    "Search codebase to confirm no user-facing strings remain hardcoded in components",
    "Run full test suite and confirm no regressions",
    "Confirm application behavior and rendering are unchanged"
  ],
  "passes": true
},
{
  "id": "copy-003",
  "title": "Rewrite landing page copy to be reader-centric and exploratory",
  "description": "Rewrite the landing page copy to sound natural, calm, and hiring-manager centric, framing the page as a project record available for inspection rather than a guided evaluation or self-presentation.",
  "acceptance_criteria": [
    "Landing page title is updated to use a neutral, non-promotional framing (e.g. 'Project Record' or equivalent)",
    "Primary framing avoids first-person narration where possible and does not center the author as the speaker",
    "Language is exploratory and descriptive rather than directive or imperative",
    "No phrases instruct the reader what to do (e.g. 'stop here', 'check', 'proceed', 'start with')",
    "Evaluation affordances are presented as available views or angles, not as a recommended path",
    "Tone is calm, factual, and human; avoids abstract system language (e.g. 'interface', 'capability discovery')",
    "No new sections, routes, or features are introduced",
    "Meaning and intent of existing content are preserved; only wording and framing change",
    "Updated copy remains consistent with the overall workplan principles"
  ],
  "verification": [
    "Manually review landing page copy to confirm absence of imperative or patronizing language",
    "Confirm landing page reads naturally when read aloud",
    "Verify no other pages were modified",
    "Run full test suite and confirm no regressions",
    "Confirm copy changes are reflected in copy.md"
  ],
  "passes": true
}













  ]
}
