{
  "meta": {
    "product": "Capability Discovery Interface",
    "description": "Candidate-controlled landing page that enables employers to evaluate reasoning, learning, and fit through investigation rather than filtering.",
    "guiding_principles": [
      "Foundations before features",
      "Verification is a product requirement",
      "Static-first, extend later",
      "Small tasks, provable completion",
      "CI must stay green"
    ]
  },
  "requirements": [
    {
      "id": "env-001",
      "title": "Reproducible development environment initializes successfully",
      "description": "Set up a reproducible development environment that can be installed and run from a clean checkout.",
      "acceptance_criteria": [
        "Repository installs dependencies using a single documented command",
        "A development server can be started locally",
        "A production build command exists and completes successfully",
        "README documents install, dev, build, and test commands",
        "All commands succeed on a clean machine"
      ],
      "verification": [
        "Run install command from clean checkout",
        "Run dev server command and verify process starts",
        "Run build command and verify successful exit"
      ],
      "passes": true
    },
    {
      "id": "test-001",
      "title": "Test harness is configured and runs in CI",
      "description": "Establish a minimal automated test setup to verify future features.",
      "acceptance_criteria": [
        "A test runner is configured",
        "At least one test file exists",
        "Tests can be run via a single command",
        "Tests run as part of CI or a local equivalent",
        "Test command exits successfully"
      ],
      "verification": [
        "Run test command locally",
        "Verify at least one passing test",
        "Verify test command fails if assertion is broken"
      ],
      "passes": true
    },
    {
      "id": "ui-001",
      "title": "Landing page renders with evaluation-focused framing",
      "description": "Create a minimal landing page that frames the site as an evaluation surface rather than a resume or portfolio.",
      "acceptance_criteria": [
        "Root route renders without errors",
        "Page includes a clear positioning statement about evaluation",
        "Language avoids resume-style claims",
        "Page content is static and deterministic",
        "Page is covered by at least one automated test"
      ],
      "verification": [
        "Start dev server and load root route",
        "Run test suite and verify landing page test passes"
      ],
      "passes": true
    },
    {
      "id": "ui-002",
      "title": "Exploration path is visible on landing page",
      "description": "Provide visible entry points that invite investigation, even if underlying features are placeholders.",
      "acceptance_criteria": [
        "Landing page includes at least two exploration CTAs",
        "CTAs clearly describe future interaction (e.g. 'Ask how I work', 'Check role fit')",
        "CTA targets are valid routes or placeholders",
        "Routes render without runtime errors",
        "Routes are covered by minimal tests"
      ],
      "verification": [
        "Navigate to CTA routes",
        "Run test suite verifying route rendering"
      ],
      "passes": true
    },
    {
  "id": "exp-001",
  "title": "Canonical experience data model exists and is validated",
  "description": "Introduce a structured, typed representation of personal experiences that serves as the single source of truth for future UI rendering and AI grounding.",
  "acceptance_criteria": [
    "A canonical experience data model is defined in code (e.g. TypeScript interfaces or schema)",
    "The model captures: context, constraints, decisions, outcomes, and lessons learned",
    "At least the three existing experiences are represented using this model",
    "Experience data is stored in a deterministic, version-controlled format (e.g. TS/JSON)",
    "The model is imported successfully by application code without runtime errors",
    "The data model is explicitly documented in code comments or README",
    "The data model can be extended without breaking existing consumers"
  ],
  "verification": [
    "Typecheck succeeds with the new model",
    "Application builds successfully after adding the model",
    "At least one automated test validates the structure or contents of the experience data",
    "Breaking the model shape causes tests or typecheck to fail"
  ],
  "passes": true
},
{
  "id": "exp-002",
  "title": "Read-only Experience Explorer renders canonical experience data",
  "description": "Expose the canonical experience data model through a read-only UI that allows employers to explore context, constraints, decisions, outcomes, and lessons learned.",
  "acceptance_criteria": [
    "A new route exists for exploring experiences (e.g. /experience or /experiences)",
    "The UI renders experiences exclusively from the canonical experience data model",
    "At least one experience can be selected and viewed in detail",
    "The detail view displays context, constraints, decisions, outcomes, and lessons learned",
    "Navigation between experiences is possible without page reloads",
    "The UI is deterministic and contains no AI-generated content",
    "The implementation introduces no breaking changes to existing routes",
    "All rendered content avoids resume-style claims and marketing language"
  ],
  "verification": [
    "Navigate to the experience explorer route and view each experience",
    "Verify that rendered content matches the canonical data model exactly",
    "Run test suite and confirm new UI tests pass",
    "Break experience data shape and confirm tests or typecheck fail"
  ],
  "passes": true
}


  ]
}
